//-----------------------------------------------------------------------------
// File: main.h
//
// Edit: 2021/03/10 野筒隼輔
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Name: class Application
// Desc: アプリケーションクラス
//-----------------------------------------------------------------------------
class Application
{
public:

	// アプリケーション実行
	void Execute();

	//--------------------------------------------------
	// 設定.所得
	//--------------------------------------------------
	// インスタンスの所得
	static Application& GetInstance() { static Application Instance; return Instance; }
	// アプリケーション終了
	void End() { m_endFlag = true; }

public:
	KdWindow	m_window;	// ゲームウィンドウクラス
	int			m_fps;		// 現在のFPS値
	int			m_maxFps;	// 最大FPS

private:
	bool		m_endFlag;	// ゲーム終了フラグ

private:
	Application();
	bool Init(int width, int height);
	void Release();
};

//-----------------------------------------------------------------------------
// Define: 簡単にアクセス
//-----------------------------------------------------------------------------
#define APP Application::GetInstance()